---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoomUpperLevel
source: html/cfb050db-627b-97ba-d2f5-e21637798617.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoomUpperLevel Property

"Upper Limit"

## Syntax (C#)
```csharp
public static ForgeTypeId RoomUpperLevel { get; }
```